# StructuralSectionHasIncompleteDefinition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralConnectionFailures..::..StructuralSectionHasIncompleteDefinition Property
BuiltInFailures..::..StructuralConnectionFailures Class See Also
---
Structural Section has incomplete definition
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralSectionHasIncompleteDefinition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionHasIncompleteDefinition As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralSectionHasIncompleteDefinition {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace